[
  {
    "id": "001",
    "task_detail": "Create CSS foundation files in the css/ directory. First, create variables.css containing CSS custom properties for the entire design system: color palette with primary electric cyan (#00D4FF, #0099CC dark, #66E3FF light), secondary vibrant purple (#8B5CF6, #6D28D9 dark, #A78BFA light), accent hot pink (#FF3D71, #DB2C66 dark, #FF6B9D light), background colors (#0A0A0F near-black, #12121A medium, #1E1E2D cards), text colors (#FFFFFF primary, #A0A0B0 secondary), gradients (primary gradient 135deg from cyan through purple to pink). Add typography variables using Inter font family with fluid type scale using clamp() for responsive sizing (text-xs through text-5xl), line heights (tight 1.2, normal 1.5, relaxed 1.75), font weights (normal 400 through black 900). Include spacing scale (4px base unit, scale from 1-20), border radius values, transition durations, and breakpoint references. Second, create reset.css with modern CSS reset including box-sizing border-box on all elements, zero margin and padding on body, smooth font rendering with antialiasing, responsive images by default, and form element font inheritance. Third, create utilities.css with utility classes: spacing utilities (m-0 through m-8, p-0 through p-8 for margin and padding on all sides and individual directions), flexbox utilities (flex, inline-flex, items-center, items-start, items-end, justify-center, justify-between, justify-start, justify-end, flex-wrap, flex-col, gap utilities), grid utilities (grid, grid-cols-1 through grid-cols-4 with responsive variants), text utilities (text-center, text-left, text-right, text-xs through text-5xl), visibility utilities (hidden, block, inline-block with responsive variants), and container class with max-width and centered margins.",
    "depends_on": []
  },
  {
    "id": "002",
    "task_detail": "Create css/layout.css containing all shared layout styles used across every page of the website. Start with the header component: fixed/sticky positioning at top, full width, dark background (#12121A) with subtle backdrop-blur effect (backdrop-filter: blur(10px)), contains logo on the left and navigation on the right, height of approximately 70-80px, z-index high enough to stay above content, smooth background transition on scroll. Create navigation styles for desktop view: horizontal list of links (Home, About, Technology, Use Cases, Contact), links styled with text color #A0A0B0, hover state transitions to primary cyan color with subtle glow, active page indicator. Create mobile navigation: hamburger menu button visible below 768px breakpoint, hidden on desktop, animated hamburger icon that transforms to X when open. Mobile menu panel: slides in from right or drops down, full width, dark background, vertical stack of links with larger touch targets (min 44px height), smooth open/close animation. Create footer component: dark background (#0A0A0F), padding top and bottom, contains logo and tagline on left, three columns of navigation links in center (Products, Company, Resources), social media icon links on right, copyright notice at bottom spanning full width, responsive layout that stacks on mobile. Create section container styles: max-width 1280px, centered with auto margins, padding-left and padding-right for gutters (16px mobile, 32px tablet, 48px desktop), section vertical padding (80px desktop, 48px mobile). Create page wrapper that ensures minimum viewport height and flex column layout for sticky footer.",
    "depends_on": []
  },
  {
    "id": "003",
    "task_detail": "Create css/components.css containing all reusable UI component styles. Button components: create base button class with padding, border-radius, font-weight, transition properties, and cursor pointer. Primary button variant with gradient background (cyan to purple), white text, on hover increase brightness and add subtle box-shadow glow effect in cyan. Secondary button with solid purple background, white text, hover brightens. Outline button with transparent background, colored border and text, on hover fills with color. Ghost button with transparent background and colored text only, subtle hover background. Button sizes: small, medium (default), large with appropriate padding and font-size adjustments. Card components: base card with dark background (#1E1E2D), border-radius (12-16px), padding, subtle border (1px solid #2E2E3E). Glassmorphism card variant with semi-transparent background (rgba), backdrop-blur effect, glowing border on hover. Feature card for displaying icons with titles and descriptions. Team card for about page with image area, name, role, and bio. Use case card with expandable content area. Form elements: input and textarea base styles with dark background, border, padding, full width, focus state with cyan border and subtle glow. Select dropdown matching input styles. Labels with secondary text color, positioned above inputs. Form groups with consistent spacing. Error state with red border and error message text. Success state with green border. Section headers: large bold text, option for gradient text effect (background-clip text with gradient), centered or left-aligned variants, with optional subtitle underneath. CTA banner: full-width section with gradient background, centered content, headline and subtext, prominent CTA button. Animation utility classes: animate-fade-in (opacity 0 to 1), animate-slide-up (translateY 20px to 0 with fade), animate-scale (scale 0.95 to 1), with appropriate keyframe definitions and timing (0.6s ease-out default).",
    "depends_on": []
  },
  {
    "id": "004",
    "task_detail": "Create all JavaScript files in the js/ directory for website interactivity. First, create main.js as the central initialization file: wrap all code in DOMContentLoaded event listener, import and initialize all other modules, define utility functions (debounce for scroll handlers, throttle for resize handlers), set up any global state needed. Second, create navigation.js handling all navigation functionality: mobile menu toggle function that adds/removes 'menu-open' class on body and header, toggles hamburger icon animation to X shape, prevents body scroll when menu is open on mobile. Smooth scroll function for anchor links that scrolls to target section with offset for fixed header height, using scrollIntoView or custom scroll animation. Sticky header behavior that adds 'scrolled' class to header after scrolling past threshold (e.g., 50px) to trigger background opacity change. Active link highlighting that detects which section is currently in viewport and adds 'active' class to corresponding nav link. Third, create animations.js with scroll-triggered animations using Intersection Observer API: create observer instance with threshold options (0.1 or 0.2), define callback function that adds 'is-visible' class when element enters viewport, query all elements with 'animate-on-scroll' class and observe them. Support for staggered animations on lists by adding delay based on element index. Number counting animation function that animates from 0 to target number for statistics section. Optional parallax effect for hero background. Fourth, create contact-form.js for form handling: form validation function that checks required fields are filled, validates email format with regex, validates phone format if provided. Show inline error messages below invalid fields. Show success message on valid submission. Prevent default form submission and handle with JavaScript. Clear form after successful submission. Add loading state to submit button during submission.",
    "depends_on": []
  },
  {
    "id": "005",
    "task_detail": "Create the assets folder structure and all placeholder visual assets needed for the website. First, create the directory structure: assets/images/ as the main images folder, with subdirectories assets/images/hero/ for hero section backgrounds and graphics, assets/images/about/ for about page team photos and company images, assets/images/technology/ for tech diagrams and illustrations, assets/images/use-cases/ for industry and case study images, assets/images/icons/ for any custom icons. Second, create assets/images/logo.svg as the primary Terro AI logo: design a modern, tech-forward logo combining the word 'TERRO' in a bold sans-serif typeface with a geometric abstract mark suggesting 3D mapping or spatial data (could be interconnected nodes, a stylized cube with depth, or abstract wireframe shape). Use the primary cyan color (#00D4FF) as the main logo color. The logo should work at various sizes from favicon to large hero display. Keep the SVG clean and optimized. Third, create assets/images/logo-white.svg as the white/light version of the logo for use on dark or colored backgrounds, identical design but in white (#FFFFFF). Fourth, create favicon.svg (or favicon.ico) using a simplified version of the logo mark only (without text) that remains recognizable at 16x16 and 32x32 pixel sizes, using the cyan brand color. Fifth, create a README.md or text file in assets/images/ documenting the placeholder images needed for each page section, including recommended dimensions and aspect ratios, so these can be added later: hero background (1920x1080), team photos (400x400 square), technology diagrams (800x600), use case illustrations (600x400), partner logos (200x80).",
    "depends_on": []
  },
  {
    "id": "006",
    "task_detail": "Create index.html as the complete Home page with all sections and proper HTML5 semantic structure. Start with DOCTYPE html declaration and html tag with lang='en'. Head section must include: charset UTF-8 meta tag, viewport meta tag for responsive design, title tag 'Terro AI - Mapping Reality for Robotic Intelligence', meta description for SEO, link tags importing all CSS files in correct order (variables.css, reset.css, utilities.css, components.css, layout.css, pages/home.css), and favicon link. Body structure: Header component with nav containing logo link to index.html and navigation links (Home with active class, About, Technology, Use Cases, Contact), mobile menu button. Main element containing all page sections. Hero section with container: headline h1 'Mapping Reality for Robotic Intelligence', subheadline paragraph 'Transform the physical world into manipulable 3D environments for AI-powered robotic simulations', two CTA buttons (primary 'Explore Technology' linking to technology.html, secondary outline 'Contact Us' linking to contact.html), decorative background element div for animated gradient or particles. Features section with section header 'Why Choose Terro AI', grid of 4 feature cards each with icon placeholder div, h3 title, and p description: 'Real-World Mapping' describing precise 3D reconstruction, 'AI Simulation' describing virtual training environments, 'Seamless Integration' describing platform compatibility, 'Real-Time Updates' describing dynamic synchronization. How It Works section with numbered steps in horizontal layout on desktop, vertical on mobile: Step 1 'Scan & Capture', Step 2 'AI Processing', Step 3 '3D Model Generation', Step 4 'Robotic Simulation', each with icon and brief description, connecting visual elements between steps. Use Cases Preview section with 3 cards linking to use-cases.html: Manufacturing Automation, Warehouse Robotics, Autonomous Vehicles, each with image placeholder, title, brief description, and 'Learn More' link. Statistics section with 3 large numbers: '99.9%' with label 'Mapping Accuracy', '10x' with label 'Faster Training', '50+' with label 'Industry Partners'. CTA Banner section with gradient background, headline 'Ready to Transform Your Robotics Development?', subtext, and primary CTA button. Footer component with logo, nav columns, social links, copyright. Script tags at end of body importing main.js, navigation.js, animations.js in correct order.",
    "depends_on": ["001", "002", "003"]
  },
  {
    "id": "007",
    "task_detail": "Create about.html as the complete About page with all sections and proper HTML5 semantic structure. Head section identical structure to index.html but with title 'About Us - Terro AI' and appropriate meta description, importing all CSS including pages/about.css. Header component identical to other pages but with About link having active class. Main element containing all about page sections. Hero section with headline h1 'About Terro AI', mission statement paragraph describing the company's purpose of bridging physical and digital worlds for robotics advancement, possibly with subtle background graphic. Mission and Vision section: two-column layout on desktop with Mission on left describing what the company does day-to-day (creating accurate 3D representations of real environments to accelerate robotics development), Vision on right describing the future goal (a world where robots seamlessly operate in any environment through perfect digital twins). Our Story / Timeline section: vertical timeline layout with key milestones, each milestone having a year/date marker on the timeline line, title of the milestone, and description paragraph. Include founding story, key product launches, major partnerships, recent achievements. Use alternating left-right layout on desktop, all on one side on mobile. Team section with section header 'Our Team' or 'Leadership', grid of 4-6 team member cards, each card containing: circular image placeholder (can use CSS gradient or placeholder), name in h3, role/title in smaller text, brief 1-2 sentence bio. Include founders, CTO, key engineering or business leads with realistic placeholder names and roles. Values section with header 'Our Values', grid of 4 value cards: 'Innovation' with description about pushing boundaries, 'Precision' about accuracy and attention to detail, 'Collaboration' about partnership approach, 'Sustainability' about responsible technology development. Each card should have an icon placeholder area. Partners / Backed By section with header 'Our Partners' or 'Backed By', horizontal row of partner logo placeholders (use simple rectangles with placeholder text or generic shapes), suggest 4-6 partner slots. Footer component identical to other pages. Script imports at end of body.",
    "depends_on": ["001", "002", "003"]
  },
  {
    "id": "008",
    "task_detail": "Create technology.html as the complete Technology page with all sections and proper HTML5 semantic structure. Head section with title 'Our Technology - Terro AI', meta description about the technical platform, all CSS imports including pages/technology.css. Header with Technology link active. Main element with all technology page sections. Hero section with headline h1 'Our Technology', subheadline paragraph providing overview of the Terro AI platform as an end-to-end solution for converting physical spaces into simulation-ready 3D environments. Core Technology Stack section with header 'Core Technology', grid of 4 technology area cards: '3D Scanning & Reconstruction' describing multi-sensor capture and point cloud processing, 'AI/ML Pipeline' describing machine learning models for scene understanding and object recognition, 'Simulation Engine' describing physics-accurate virtual environment generation, 'Integration APIs' describing REST and SDK interfaces for robotics platforms. Each card with icon placeholder, title, and detailed description paragraph. Technical Deep Dive section with expandable accordion-style content, 4-5 expandable items: 'Real-World Mapping Methodology' explaining scanning process and accuracy, 'Machine Learning Models' explaining AI architecture, 'Physics Simulation' explaining realistic physics, 'Data Processing Pipeline' explaining the workflow from scan to simulation, 'Cloud and Edge Deployment' explaining deployment options. Each item has clickable header that expands to show detailed content paragraph. Platform Features section with grid of feature items: 'Multi-Sensor Fusion' combining LiDAR camera and depth sensors, 'Real-Time Processing' for live environment updates, 'Cloud Infrastructure' for scalable processing, 'Edge Deployment' for on-premises needs, 'RESTful API' for easy integration, 'SDK Libraries' for Python and C++ support. Technical Specifications section presented as a styled table or card grid: supported sensors, accuracy metrics, processing speeds, output formats, platform compatibility. Integration Partners section showing logos of compatible robotics platforms (ROS, Gazebo, NVIDIA Isaac, etc.) as placeholder boxes. Footer and scripts.",
    "depends_on": ["001", "002", "003"]
  },
  {
    "id": "009",
    "task_detail": "Create use-cases.html as the complete Use Cases page with all sections and proper HTML5 semantic structure. Head section with title 'Use Cases - Terro AI', meta description about industry applications, all CSS imports including pages/use-cases.css. Header with Use Cases link active. Main element containing all sections. Hero section with headline h1 'Use Cases', subheadline 'See how Terro AI is transforming industries with precise 3D world mapping for robotic simulations'. Industry Cards section with 5 expandable industry cards, each card containing: industry icon placeholder, industry title as h3, brief overview paragraph visible by default, expandable content section (hidden by default) containing three subsections - Challenge (describing the industry problem), Solution (how Terro AI addresses it), Results (quantified benefits). Industries to include: 'Manufacturing Automation' covering assembly line robots and quality control, 'Warehouse & Logistics' covering inventory robots and fulfillment automation, 'Autonomous Vehicles' covering self-driving car simulation and testing, 'Construction & Architecture' covering site planning and safety robotics, 'Research & Academia' covering robotics research and education. Each card should have a 'Learn More' or expand button that toggles the detailed content visibility. Case Study Highlights section with header 'Featured Case Studies', 2-3 case study cards in larger format: each with image placeholder area (representing the industry/client), case study title, brief results summary (e.g., '40% reduction in training time'), and 'Read Full Study' link (can be placeholder href='#'). Include fictional but realistic company names and scenarios. ROI / Benefits section with header 'The Terro AI Advantage', grid of 4-6 benefit metrics presented visually: 'Reduce Physical Testing by 80%', 'Accelerate Development 10x', 'Cut Training Costs 60%', '99.9% Environment Accuracy', presented as large numbers with supporting text. CTA section with gradient background, headline 'See How Terro AI Can Work For Your Industry', description text, and primary CTA button linking to contact page. Footer and script imports.",
    "depends_on": ["001", "002", "003"]
  },
  {
    "id": "010",
    "task_detail": "Create contact.html as the complete Contact page with form and all sections. Head section with title 'Contact Us - Terro AI', meta description, all CSS imports including pages/contact.css. Header with Contact link active. Main element containing all contact page sections. Hero section with headline h1 'Get in Touch', welcoming subheadline paragraph inviting visitors to reach out for demos, partnerships, or questions. Contact Form section as the primary content: form element with id for JavaScript targeting, form fields arranged in responsive grid (single column mobile, two columns desktop where appropriate). Required fields: Name input (text, required, placeholder 'Your Name'), Email input (email type, required, placeholder 'your@email.com'), Company input (text, optional, placeholder 'Company Name'). Optional Phone input (tel type, placeholder '+1 (555) 000-0000'). Inquiry Type select dropdown with options: 'General Inquiry', 'Request a Demo', 'Partnership Opportunity', 'Technical Support', 'Media Inquiry'. Message textarea (required, placeholder 'How can we help you?', minimum 4 rows). Submit button with primary styling and text 'Send Message'. Include div for form success message (hidden by default) and error message display areas near each field. Contact Information section alongside or below form: card or section containing Email with mailto link (contact@terro.ai placeholder), Phone number (placeholder), Office Address (placeholder city and country). FAQ section with header 'Frequently Asked Questions', accordion of 5-6 common questions with expandable answers: 'What industries does Terro AI serve?', 'How accurate is the 3D mapping?', 'What robotics platforms do you integrate with?', 'How long does implementation take?', 'Do you offer demos?', 'What support do you provide?'. Each FAQ item clickable header that toggles answer visibility. Social Links section with icons/links for LinkedIn, Twitter/X, GitHub (placeholder hrefs), styled as icon buttons. Footer and script imports including contact-form.js.",
    "depends_on": ["001", "002", "003"]
  },
  {
    "id": "011",
    "task_detail": "Create css/pages/home.css containing all styles specific to the Home page (index.html). Hero section styles: full viewport height or near-full (min-height: 100vh or 90vh), flexbox centering for content, animated gradient background using CSS animation (background-size larger than container, animate background-position), alternative option of particle/geometric pattern overlay. Hero headline with very large font size (text-4xl or text-5xl), bold weight, optional gradient text effect. Hero subheadline with lighter weight, secondary text color, max-width for readability. Hero CTA container with flexbox row, gap between buttons, stack vertically on mobile. Features section: grid layout 4 columns on desktop (grid-template-columns: repeat(4, 1fr)), 2 columns on tablet, 1 column on mobile. Feature cards with consistent height, icon area at top (could be colored circle or square background), padding, hover effect (slight lift with box-shadow, or border glow). How It Works section: horizontal layout on desktop using flexbox or grid, each step as a flex item, connecting lines between steps using CSS pseudo-elements (::after with border or gradient line), numbered circles or step indicators. On mobile, vertical layout with connecting line on left side. Step hover states highlighting current step. Use Cases Preview section: 3-column grid on desktop, cards with image area at top (aspect-ratio or padding-trick for consistent height), gradient overlay on image, title and description below, hover effect lifting card or showing additional info. Statistics section: flexbox row with large numbers, each stat with large number (text-4xl or bigger), plus sign or percentage suffix, smaller label below. Numbers should have class for animation targeting. Add keyframes for number counting or fade-in effect. CTA Banner section: full-width gradient background matching brand gradient, centered text content, white text, enough padding top and bottom, button in white or outline style for contrast. All sections should have responsive adjustments at tablet (768px) and mobile (640px) breakpoints with reduced spacing, smaller typography, and adjusted layouts.",
    "depends_on": ["006"]
  },
  {
    "id": "012",
    "task_detail": "Create css/pages/about.css containing all styles specific to the About page (about.html). Hero section: similar height to other pages but can be shorter than home (60vh or fixed height), centered content, subtle background pattern or gradient, mission statement styled as larger text with emphasis. Mission and Vision section: two-column grid on desktop (grid-template-columns: 1fr 1fr with gap), single column stacked on mobile, each column as a card or distinct section with heading and paragraph, optional decorative border or background difference between the two. Timeline / Our Story section: vertical timeline layout with central line on desktop (use ::before pseudo-element on container for vertical line), timeline items alternating left and right using nth-child selectors and flexbox direction, each item has date/year badge positioned on the timeline, content card extending to the side. Timeline line could be gradient or solid brand color. On mobile, all items stack on one side with timeline line on left edge, items extending right. Team section: grid of team cards, 4 columns on desktop, 3 on tablet, 2 or 1 on mobile. Team card styles: circular image container at top using border-radius: 50% with overflow hidden, or gradient background if using placeholder, fixed aspect ratio for image area. Name styled as h3 with larger font, role in smaller secondary color text below, bio text in body size. Hover effect could reveal additional info, show social links, or add subtle glow/border highlight. Values section: 4-column grid on desktop, 2 on tablet, 1 on mobile. Value cards with icon area at top (large font icon or colored shape placeholder), value name as heading, description paragraph. Cards could have subtle gradient background or glassmorphism effect. Partners section: horizontal flexbox row with flex-wrap, logos centered, grayscale by default with color on hover effect (filter: grayscale(100%) transitioning to grayscale(0%)), consistent logo sizing using max-height and width auto. Responsive breakpoints with mobile adjustments for all sections.",
    "depends_on": ["007"]
  },
  {
    "id": "013",
    "task_detail": "Create css/pages/technology.css containing all styles specific to the Technology page (technology.html). Hero section: consistent with other pages, centered headline and subheadline, could have subtle tech-themed background pattern (grid lines, dots, or circuit-like pattern using CSS). Core Technology Stack section: 4-column grid on desktop, 2 columns tablet, 1 column mobile. Tech cards with icon area at top (large icon or abstract tech symbol), title, and detailed description. Cards should feel technical - consider adding subtle code-like elements, monospace font accents, or terminal-style details. Hover state with border glow in brand colors. Technical Deep Dive accordion section: each accordion item as a container with clickable header and collapsible content. Header contains title and expand/collapse indicator (plus/minus icon or chevron using CSS pseudo-elements or unicode characters). Content area with max-height: 0 and overflow: hidden by default, transitioning to max-height when open class is added. Smooth height transition for expanding/collapsing. When open, header should show different indicator state. Style active/open items with accent border on left or highlighted background. Platform Features section: smaller feature items in tighter grid (3 columns desktop, 2 tablet, 1 mobile), each item with small icon, feature name, and one-line description. More compact styling than main cards. Could use a list with styled bullets or inline icon + text pattern. Technical Specifications section: if using table, style with dark header row, alternating row backgrounds, good cell padding, border styling matching brand. If using cards, grid layout with spec name and value clearly differentiated. Ensure good readability of technical data. Integration Partners section: horizontal layout of platform logos/names, could be styled as pills or badges, grayscale to color hover effect, centered alignment with wrapping on smaller screens. All sections with proper responsive breakpoints.",
    "depends_on": ["008"]
  },
  {
    "id": "014",
    "task_detail": "Create css/pages/use-cases.css containing all styles specific to the Use Cases page (use-cases.html). Hero section: standard page hero styling, headline and subheadline centered. Industry Cards section: large cards in single column or 2-column layout, each card prominent with industry icon, title, overview paragraph always visible. Expandable content area: max-height: 0 with overflow: hidden by default, smooth transition to expanded state when card has 'open' or 'expanded' class. Expand button or clickable header area styled clearly as interactive. When expanded, show Challenge/Solution/Results subsections with clear visual separation (could use small headers, different background sections, or left border accent for each). Challenge/Solution/Results layout: three subsections within expanded content, each with clear label heading (could be uppercase small text or icon + text), content paragraph. Could be vertical stack or three-column on very wide screens. Visual indicators for each type (e.g., red/orange accent for Challenge, blue/cyan for Solution, green for Results). Card hover states with subtle lift or border highlight even when not expanded. Case Study Highlights section: larger featured cards (1 card per row on mobile, 2 on tablet, 3 on desktop). Card structure with image area (16:9 or similar aspect ratio, could use gradient placeholder), title, results summary shown prominently (large text for numbers), 'Read Full Study' link styled as text button. Image could have overlay gradient for text readability if text overlays image. ROI/Benefits section: grid of metric items, each metric with very large number/percentage (text-3xl to text-5xl), descriptive label below in smaller text. Numbers could have gradient text effect or brand color. Consider using CSS counters or data attributes for animation targeting. Grid 4 columns desktop, 2 tablet, 1-2 mobile. CTA section: full-width gradient background matching CTA banners on other pages, white centered text, prominent button. Responsive adjustments throughout.",
    "depends_on": ["009"]
  },
  {
    "id": "015",
    "task_detail": "Create css/pages/contact.css containing all styles specific to the Contact page (contact.html). Hero section: standard page hero, possibly shorter height since form is main content, centered headline and welcoming subtext. Contact Form section: form container with max-width for readability (600-700px), centered on page or positioned alongside contact info on desktop. Form grid layout: use CSS grid for field arrangement, 2 columns on desktop (Name and Email side by side, Company and Phone side by side, Inquiry Type full width, Message full width, Submit button full width or right-aligned). Single column on mobile with all fields stacked. Form field styling: input and textarea with dark background (#1E1E2D), border color (#2E2E3E), padding 12-16px, border-radius matching brand, font-size comfortable for reading. Focus state: border color changes to primary cyan, subtle box-shadow glow. Placeholder text in secondary color. Label styling: positioned above input, secondary text color, font-size slightly smaller than input text, margin-bottom creating space. Error state styling: input border turns red/coral (accent color), error message text appears below field in red, error icon could appear inside input on right. Success state: green border on valid fields (optional). Form error message container (for form-level errors) styled as alert box with error background and icon. Form success message styled as centered success card with checkmark icon, success heading, and descriptive text, replaces or overlays form when shown. Submit button full width or auto width right-aligned, primary button styling, hover state, disabled state (reduced opacity, cursor not-allowed) for loading. Contact Information section: could be sidebar on desktop (2-column layout with form) or separate section below on mobile. Each contact method (email, phone, address) as a card or list item with icon and text. Icons could be CSS-drawn or unicode. FAQ Accordion section: similar styling to technology page accordion, question as clickable header with expand indicator, answer as collapsible content with smooth transition. Question text styled as h4 or bold, answer as regular paragraph. FAQ items with spacing between them, subtle borders or cards containing each item. Social Links section: horizontal row of social icons as circular or square buttons, brand colors or white, hover state with background or scale effect. Centered alignment.",
    "depends_on": ["010"]
  },
  {
    "id": "016",
    "task_detail": "Integration task: Connect all JavaScript functionality with the HTML pages and verify everything works correctly. Open each HTML page in browser and test all interactive features systematically. Navigation testing on all 5 pages: verify mobile menu hamburger button appears on screens below 768px, clicking hamburger opens mobile menu with smooth animation, menu links are visible and clickable, clicking a link closes the menu and navigates to page, clicking hamburger again or outside menu closes it, body scroll is disabled when mobile menu is open. Verify desktop navigation appears correctly on wider screens, hover states work on nav links, active page link is highlighted. Smooth scroll testing: on any page with anchor links (if any internal page anchors exist), verify clicking scrolls smoothly to target section with offset for fixed header height. Sticky header testing: scroll down on any page and verify header background becomes more opaque or adds shadow after scrolling threshold, scroll back up and verify it returns to initial state. Scroll animations testing on all pages: verify elements with animation classes (fade-in, slide-up) are initially hidden or in start state, scrolling to bring elements into viewport triggers the animation, animations fire only once (don't reset when scrolling away and back). Test on multiple pages with animated sections. Statistics number animation: on home page, verify the statistics numbers animate/count up when scrolled into view. Accordion/expandable section testing: on Technology page, verify clicking accordion headers expands content with smooth animation, clicking again collapses, expand indicator changes state. On Use Cases page, verify industry cards expand/collapse correctly. On Contact page, verify FAQ accordion works. Contact form testing: on Contact page, try submitting empty form - verify validation errors appear for required fields. Try invalid email format - verify email validation error. Fill all required fields correctly and submit - verify success message appears or appropriate handling occurs. Verify error messages clear when user starts correcting the field. Fix any JavaScript errors found in browser console during testing. Ensure all event listeners are properly attached and functioning.",
    "depends_on": ["004", "006", "007", "008", "009", "010"]
  },
  {
    "id": "017",
    "task_detail": "Responsive testing and fixes across all pages to ensure the website works perfectly on all device sizes. Use browser developer tools to test at specific breakpoints. Test at mobile sizes (320px, 375px, 414px representing small phones to larger phones): verify all text is readable without horizontal scrolling, navigation hamburger menu works, all cards stack into single column, images scale properly, touch targets are at least 44px, form fields are full width and easy to tap, footer stacks into single column, no content overflows horizontally. Test at tablet sizes (768px, 1024px): verify navigation transitions appropriately between mobile and desktop, grids show 2-column layouts where designed, hero sections look proportional, cards have appropriate sizing. Test at desktop sizes (1280px, 1440px, 1920px): verify max-width containers center correctly, grids show full column counts, adequate white space on very wide screens, images don't become too large. Page-by-page responsive check: Home page - hero looks good at all sizes, features grid adjusts, how-it-works steps reflow, stats readable. About page - timeline reflows from alternating to single-side, team grid adjusts, mission/vision stacks on mobile. Technology page - tech stack grid adjusts, accordion full-width, features grid reflows, specs table scrolls horizontally if needed or reflows. Use Cases page - industry cards full width on mobile, case studies reflow, metrics grid adjusts. Contact page - form fields reflow properly, form/contact-info layout adjusts, FAQ accordion full width. Fix any issues found: adjust media queries, fix overflow issues, adjust font sizes if needed, fix any broken layouts, ensure consistent spacing at all sizes. Test touch interactions on actual mobile device or device emulation - ensure all clickable elements respond to touch. Document any remaining issues that would need actual device testing.",
    "depends_on": ["011", "012", "013", "014", "015", "016"]
  },
  {
    "id": "018",
    "task_detail": "Final polish and cross-browser testing to ensure production-ready quality. Animation polish: review all animations and transitions across the site, adjust timing functions for smoother feel (ease-out for entrances, ease-in-out for hovers), ensure animation durations are consistent (0.3s for quick UI feedback, 0.6s for scroll reveals), add any missing hover states, verify animations don't cause layout shift or jank. Test on Chrome (primary): verify all features work, check DevTools console for any errors or warnings, test Lighthouse performance score and address any major issues. Test on Firefox: verify all CSS works (especially newer features like backdrop-filter, check if fallbacks needed), verify JavaScript functionality, fix any Firefox-specific issues. Test on Safari (if available, or use online testing tool): verify webkit-specific CSS properties work, check for any Safari-specific bugs especially with flexbox or grid, verify smooth scrolling works. Test on Edge: verify modern Edge (Chromium) works like Chrome, note any issues. Address cross-browser issues: add vendor prefixes where needed (-webkit-backdrop-filter for Safari), add fallbacks for unsupported features (solid background fallback for backdrop-filter), fix any flexbox or grid inconsistencies. Link verification: click all navigation links and verify they go to correct pages, verify all internal page links work, verify any external links (social media placeholders) have appropriate href or placeholder. Meta and SEO check: verify each page has unique and descriptive title tag, verify meta descriptions are present and unique, verify viewport meta tag is correct, verify favicon displays in browser tab. Visual consistency review: check all pages side by side for consistent spacing, typography, and component styling, verify brand colors are consistent, ensure header and footer are identical across all pages. Performance check: verify no large layout shifts on page load, ensure images would be optimized (note in comments if placeholder images should be compressed), verify no render-blocking issues. Create brief summary of any known issues or future recommendations.",
    "depends_on": ["017"]
  }
]
